//それぞれのモードでのグラフの値
var value = [	[0,3,6,10,13,17,20,24,27,31,34,37,41,44,48,51,55,58,62,65,68,72,75,79,82,86,89,93,96,100],
				[100,96,93,89,86,82,79,75,72,68,65,62,58,55,51,48,44,41,37,34,31,27,24,20,17,13,10,6,3,0],
				[50,56,62,68,72,76,78,79,79,77,74,70,65,59,53,46,40,34,29,25,22,20,20,21,23,27,31,37,43,49],
				[30,35,38,39,38,34,28,23,20,20,22,26,32,36,39,39,36,32,26,22,20,20,23,28,34,38,39,38,35,30],
				[30,36,42,49,55,60,66,71,75,79,83,85,87,89,89,89,89,87,85,83,79,75,71,66,60,55,49,42,36,30],
				[75,71,68,64,61,57,54,50,47,43,40,37,33,30,26,26,30,33,37,40,43,47,50,54,57,61,64,68,71,75],
				[55,57,59,61,63,65,67,69,71,73,75,77,79,81,83,83,81,79,77,75,73,71,69,67,65,63,61,59,57,55],
				[90,85,81,77,73,69,65,62,59,56,54,52,51,50,50,50,50,51,52,54,56,59,62,65,69,73,77,81,85,90]
			];

var pt = new Array();	//それぞれのグラフの長さをPhysicalPoint型で管理する
var mode = 0;		//モード番号

function setup(){
	//30個のPhysicalPoint型を生成
	for(var i = 0; i < 30; i = i+1){
		pt[i] = new PhysicalPoint(0);	//長さ（１つだけの値）なのでxしか使わない
		pt[i].b = 0.8;	//摩擦係数を0.8にしておく（動きが鈍くなる）
	}
}

function loop(){
	//それぞれのptの値をvalueの今のモードの値に向けて加速する
	for(var i = 0; i < pt.length; ++i){
		pt[i].setKasokudo((value[mode][i] - pt[i].x)*60);
	}
	
	//描画
	pbCtx.clearRect(0, 0, screenWidth, screenHeight);
	for(var i = 0; i < pt.length; ++i){
		//画面の幅からグラフの間隔を計算
		var kankaku = ((screenWidth-200)/(pt.length-1));
		pbCtx.beginPath();
		pbCtx.lineWidth = kankaku - 4;	//間隔より４少ない太さのグラフにする（グラフ間があく）
		//一個おきに薄いグレーと濃いグレーでグラフを描く
		if(i % 2 == 0)	pbCtx.strokeStyle = 'rgb(100, 100, 100)';
		else			pbCtx.strokeStyle = 'rgb(200, 200, 200)';
		if(pt[i].x > 0){
			pbCtx.moveTo(100+i*kankaku, 900);
			pbCtx.lineTo(100+i*kankaku, 900 - pt[i].x*8);
		}
		pbCtx.stroke();
	}
}

function onPressed(n){
	//タッチされたらモードを変更する
//	mode = mode + 1;
//	if(mode > 7)	mode = 0;
	
	mode = (mode+1) % value.length;
}

function onMove(n){
	
}

function onReleased(n){
	
}
